/*有一群猴子，去摘了一堆桃子*/

/*商量之后决定每天吃剩余桃子的一半*/

/*当每天大家吃完桃子之后，有个贪心的小猴都会偷偷再吃一个桃子*/

/*按照这样的方式猴子们每天都快乐的吃着桃子*/

/*直到第十天，当大家再想吃桃子时，发现只剩下一个桃子了*/

/*问：猴子们一共摘了多少桃子*/


#include<stdio.h>   
int main()  
{  
    int total = 0;//桃子总数  
    int rest = 1;//第10天只剩一个桃子  
    int day = 9;  
    while(day--)  
    {  
        total = (rest + 1) * 2;//每天的桃子总数是后一天剩余桃子加1乘2  
        rest = total;  
    }  
    printf("猴子第一天一共摘了%d个桃子\n",total);  
    return 0;  
}  


/***************************************************************************** 
#include<stdio.h>  
#include <stdlib.h>  
int main()  
{  
    int peach = 0;//桃子总数  
    int rest = 1;//第10 天只剩一个桃子  
    int day = 0;  
    for(day = 9; day > 0; day--)  
    {  
        peach = (rest + 1) * 2;//每天的桃子总数是后一天剩余桃子加1乘2  
        rest = peach;  
    }  
    printf("猴子第一天一共摘了%d个桃子\n",peach);  
    system("pause");  
    return 0;  
}  
****************************************************************************/ 
